Revit 2026 API

# TessellatedShapeBuilderDoesFaceHaveEnoughLoopsAndVertices Method

---

Checks whether 'face' has enough loops and vertcies to be valid.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public bool DoesFaceHaveEnoughLoopsAndVertices(
	TessellatedFace face
)
```
```vb
Public Function DoesFaceHaveEnoughLoopsAndVertices (
	face As TessellatedFace
) As Boolean
```
```cpp
public:
bool DoesFaceHaveEnoughLoopsAndVertices(
	TessellatedFace^ face
)
```
```fsharp
member DoesFaceHaveEnoughLoopsAndVertices :
        face : TessellatedFace -> bool
```

#### Parameters

face TessellatedFace
     The face to check.

#### Return Value

Boolean

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

Face 'face' is not modified.

#### Reference

TessellatedShapeBuilder Class

Autodesk.Revit.DB Namespace